export default function Climat() {
  return (
    <div>
      <div className="wind-free-header">
        <span>Прохлада. WindFree™</span>
        <div className="wind-free-header-img">
          <img
            src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_KV_Windfree_1440x344_PC_dim.png?imwidth=1366"
            alt="Настенный кондиционер, кассетный 4-х поточный кондиционер, кассетный 1-но поточный кондиционер и кассетный кондиционер 360 расположены рядом на красочном фоне с узором из белых точек, напоминающим микроотверстия кондиционеров Samsung с технологией прохлады WindFree™."
          ></img>
        </div>
      </div>
      <div className="innovation-wind-free-heading">
        <h1>Инновационная технология Samsung WindFree™</h1>
        <p>
          ASHRAE (Американское общество инженеров по отоплению, охлаждению и
          кондиционированию воздуха) определяет неподвижный воздух как воздушные
          потоки на скорости ниже 0,15 м/с без струй холодного воздуха.
        </p>
      </div>
      <div className="technologies-wind-free">
        <h1 className="technologies-heading">Технологии</h1>
        <h1 className="cooling-wind-free">Охлаждение WindFree™</h1>
        <p>
          Инновационная технология WindFree™ от Samsung — единственная система,
          которая использует «неподвижный воздух» для создания равномерно
          прохладной и комфортной среды в жилой зоне.
        </p>
      </div>
      <div className="men-in-air">
        <img
          class="image__main responsive-img image--loaded"
          alt="Женщина и мужчина парят в воздухе с ноутбуком, карандашом и некоторыми канцелярскими принадлежностями из-за ветра из круглого отверстия в желтой стене."
          src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Windfree_cooling_1440x810.jpg?$FB_TYPE_A_JPG$"
        ></img>
        <p>
          * ASHRAE (Американское общество инженеров по отоплению, охлаждению и
          кондиционированию воздуха) определяет неподвижный воздух как воздушные
          потоки на скорости ниже 0,15 м/с без струй холодного воздуха.
        </p>
      </div>
      <div className="wind-free-info">
        <div className="advantages">
          <h1 className="advantages-heading">Преимущества</h1>
          <div className="advantages--comfort">
            <img
              alt="Через десятки тысяч микроотверстий кондиционера с цифровым инвертором переменного тока Samsung с режимом WindFree™ поток холодного воздуха выходит наружу как ледяной дым — без сквозняков."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_True_comfort_720x752_resized.png?$720_N_PNG$"
            ></img>
            <div className="advantages--comfort-title">
              <h1>Подлинный комфорт</h1>
              <p>
                Технология WindFree™ позволяет сформировать гораздо более мягкий
                воздушный поток, равномерно распределенный через десятки тысяч
                микроотверстий. Люди в помещении не чувствуют сквозняков —
                только комфортную прохладу.
              </p>
            </div>
          </div>
          <div className="advantages--comfort">
            <div className="advantages--comfort-title">
              <h1>Затраты на электроэнергию ниже</h1>
              <p>
                При работе в режиме WindFree™ наружный блок потребляет меньше
                электроэнергии по сравнению с обычным режимом охлаждения*. Можно
                просто наслаждаться приятной прохладой, не беспокоясь о расходах
                на электроэнергию.
              </p>
              <span>
                * По данным внутренних испытаний моделей — 4-х поточной
                WindFree™, 1-но поточной WindFree™ и настенной WindFree™ — по
                сравнению с энергопотреблением в обычном режиме охлаждения.
                Температурные условия: снаружи: 35 °C (сух. терм.) / 24 °C
                (влажн. терм.); внутри: 27 °C (сух. терм.) / 19 °C (влажн.
                терм.). Результаты могут отличаться в зависимости от окружающей
                среды и особенностей использования. ** Экономия энергии может
                варьироваться в зависимости от модели, факторов окружающей среды
                и особенностей использования.
              </span>
            </div>
            <img
              alt="Настенный кондиционер Samsung работает в режиме WindFree™, темно-синий диван и круглый столик удобно расположены в гостиной, окруженной стеной с белыми точками на желтом фоне. Гистограмма наглядно показывает, что в режиме WindFree™ экономия энергии составляет 58 % по сравнению с обычным режимом."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Energy_cost_saving_720x752_resized.png?$720_N_PNG$"
            ></img>
          </div>
          <div className="advantages--comfort">
            <img
              alt="Женщина крепко спит в постели, собака отдыхает поблизости, ведь кассетный кондиционер Samsung с режимом WindFree™ работает очень тихо. На гистограмме со шкалой, где громкость дыхания составляет 10 дБ, звуков в спальне — 20 дБ, шепота — 30 дБ и библиотеки — 40 дБ, режим WindFree™ в диапазоне от 16 дБ до 32 дБ производит меньше шума, чем нормальный режим (более 30 дБ)."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Less_noise_720x752_resized.png?$720_N_PNG$"
            ></img>
            <div className="advantages--comfort-title">
              <h1>Низкий уровень шума</h1>
              <p>
                Низкоскоростное охлаждение WindFree™ практически бесшумно.
                Кондиционеры в этом режиме работают гораздо тише, чем в обычном
                режиме охлаждения. Низкий уровень шума подтвержден строгими
                испытаниями каждой модели в безэховом помещении*.{" "}
              </p>
              <span>
                * Уровень звукового давления — относительная величина; зависит
                от условий эксплуатации (расстояние, акустическая среда и пр.) и
                конкретной модели.
              </span>
            </div>
          </div>
          <h1 className="galery-heading">Галерея</h1>
          <div className="advantages--comfort">
            <div className="advantages--comfort-title">
              <h1>Найдите себе подходящий кондиционер</h1>
              <h2>Настенный</h2>
              <p>
                Комфорт без холодных сквозняков с оптимальной температурой,
                влажностью и чистотой.
              </p>
            </div>
            <img
              alt="Настенный кондиционер Samsung висит на стене с белыми точками на желтом, синем и красном фоне. Настенный кондиционер Samsung работает в режиме WindFree ™ для экономии энергии."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Gallery_Wallmounted_720x752_resized.png?$720_N_PNG$"
            ></img>
          </div>
          <div className="advantages--comfort">
            <img
              alt="Кассетный 1-но поточный кондиционер Samsung хорошо сочетается с желтым, красным и зеленым фоном с белыми точками. На потолке современной гостиной на желтом фоне находится 1-но поточный кассетный кондиционер с функцией WindFree ™ для энергосберегающего кондиционера."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Gallery_1way_cassette_720x752_resized.png?$720_N_PNG$"
            ></img>
            <div className="advantages--comfort-title">
              <h1>Найдите себе подходящий кондиционер</h1>
              <h2>Кассетный 1-но поточный</h2>
              <p>
                Компактное потолочное размещение Эффективное охлаждение без
                холодных сквозняков.
              </p>
            </div>
          </div>
          <div className="advantages--comfort">
            <div className="advantages--comfort-title">
              <h1>Найдите для себя подходящий кондиционер</h1>
              <h2>Кассетный 4-х поточный</h2>
              <p>
                Эффективное охлаждение без прямых потоков воздуха: больше
                комфорта, меньше энергозатрат.
              </p>
            </div>
            <img
              alt="Кассетный 4-х поточный кондиционер Samsung с функцией быстрое охлаждения на фоне голубого бассейна, желтого и зеленого фонов с белыми точками. В частности, на желтом фоне на потолке в широкой столовой висит кассетный 4-х поточный кондиционер Samsung."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Gallery_4way_cassette_720x752_resized.png?$720_N_PNG$"
            ></img>
          </div>
          <div className="advantages--comfort">
            <img
              alt="На фоне зеленого, синего и красного цветов изображен кассетный кондиционер Samsung 360. На зеленом фоне с белыми точками кассетный кондиционер Samsung 360 установлен на потолке в стильной гостиной. На синем фоне с пончиками и кексами изображен кассетный кондиционер Samsung 360, тихий и энергосберегающий."
              src="//images.samsung.com/is/image/samsung/assets/ru/p6-b2b/gro1/windfree/DA_FT02_Gallery_360_cassette_720x752_resized.png?$720_N_PNG$"
            ></img>
            <div className="advantages--comfort-title">
              <h1>Найдите себе подходящий кондиционер</h1>
              <h2>Кассетный кондиционер 360 </h2>
              <p>
                Круговая конструкция, поток воздуха во всех направлениях.
                Инновации для повышения комфорта и улучшения внешнего вида.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}
